---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.StackedWallNeedsUnjoin
source: html/56042a8c-e10e-b2fa-5802-3b4c86020167.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.StackedWallNeedsUnjoin Property

A subwall of this stacked wall is unjoined from its neighbors because it was pulled too far.

## Syntax (C#)
```csharp
public static FailureDefinitionId StackedWallNeedsUnjoin { get; }
```